Repository: LucasGerosa/n-back-python
Catalog: translations/*/LC_MESSAGES/app.po
Languages: pt_br

source: Main menu
pt_br: Menu principal

source: Settings
pt_br: Configurações

source: Setting Name:
pt_br: Nome da configuração:

source: Setting value:
pt_br: Valor da configuração:

source: Save
pt_br: Salvar

source: Settings saved
pt_br: Configurações salvas

source: Settings have been successfully saved.
pt_br: As configurações foram salvas com sucesso.

source: Reset settings
pt_br: Redefinir configurações

source: Settings reset
pt_br: Configurações redefinidas

source: Settings have been successfully reset.
pt_br: As configurações foram redefinidas com sucesso.

source: Choose a test
pt_br: Escolha um teste

source: Debug
pt_br: Depurar

source: Player name
pt_br: Nome do jogador

source: Number of notes
pt_br: Quantidade de notas

source: BPM (beats per minute)
pt_br: BPM (batidas por minuto)

source: Instrument (piano or guitar)
pt_br: Instrumento (piano ou guitarra)

source: Incorrect input
pt_br: Entrada incorreta

source: Please enter a valid instrument, not "{text}"
pt_br: Por favor, digite um instrumento válido, não "{text}"

source: Please enter something.
pt_br: Por favor, digite algo.

source: Reset
pt_br: Resetar

source: The following fields are incorrect or incomplete:
pt_br: Os seguintes campos estão incorretos ou incompletos:

source: Correct them and try again.
pt_br: Corrija-os e tente novamente.

source: Play
pt_br: Tocar

source: Exit
pt_br: Sair

source: Test stopped
pt_br: Teste interrompido

source: The test was stopped, just wait for the notes to finish playing before playing another test.
pt_br: O teste foi interrompido. Aguarde as notas terminarem de tocar antes de iniciar outro teste.

source: Is the last played note the same as the note {} notes ago?
pt_br: A última nota tocada é igual à nota {} notas atrás?

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Language doesn't exist
pt_br: Linguagem não existe

source: Please enter a valid language.
pt_br: Por favor, digite uma linguagem válida.

source: Settings failed to save
pt_br: Falha ao salvar configurações

source: The following settings are incorrect or incomplete:
pt_br: As seguintes configurações estão incorretas ou incompletas:

source: Language doesn't exist; Please enter a valid language.
pt_br: Linguagem não existe; Por favor, digite uma linguagem válida.

source: The number of notes + 1 needs to be greater than n-back
pt_br: A quantidade de notas + 1 precisa ser maior que a de n-back

source: Are both the sequences the same?
pt_br: As duas sequências são iguais?

source: Ready for the next sequence?
pt_br: Pronto para a próxima sequência?

source: Ready for the next trial?
pt_br: Pronto para a próxima série?

source: Loading
pt_br: Carregando

source: test
pt_br: teste

source: Test
pt_br: Teste

source: Random
pt_br: Aleatório

source: Random C major scale
pt_br: Escala de C maior aleatória

source: Tonal C major scale
pt_br: Escala tonal de C maior

source: Tonal n-back test
pt_br: Teste n-back tonal

source: Visuotonal n-back test
pt_br: Teste n-back visuotonal

source: Tonal discrimination task
pt_br: Teste de discriminação tonal

source: Tonal Discrimination Task
pt_br: Teste de Discriminação Tonal

source: Is the last played note the same as the note three places before it?
pt_br: A última nota tocada é igual à antepenúltima nota?

source: Is the last played note the same as the note before the previous note?
pt_br: A última nota tocada é igual à penúltima nota?

source: Is the last played note the same as the previous note?
pt_br: A última nota tocada é igual à nota anterior?

source: Is the last played note the same as the {}th note before the last?
pt_br: A última nota tocada é igual à nota {} antes da última?

source: Number of trials
pt_br: Quantidade de séries

source: notes
pt_br: notas

source: note intensity
pt_br: intensidade da nota

source: note duration
pt_br: duração da nota

source: language
pt_br: idioma

source: all
pt_br: todas

source: Information
pt_br: Informação

source: Help
pt_br: Ajuda

source: The following trial will have you compare the last note with the previous note.
pt_br: No próximo teste, você deve comparar a última nota com a penúltima nota.

source: The following trial will have you compare the last note with the note before the previous note.
pt_br: No próximo teste, você deve comparar a última nota com a penúltima nota.

source: The following trial will have you compare the last note with the note three places before it.
pt_br: No próximo teste, você deve comparar a última nota com a antepenúltima nota.

source: The following trial will have you compare the last note with the {}th note before the last.
pt_br: No próximo teste, você deve comparar a última nota com a {}ª nota antes da última.

source: In this test, you will hear a sequence of notes. Then, there will be a 1-second pause, and you will hear another sequence of notes. You will be asked if the second sequence is the same as the first one.
pt_br: Este é o teste de discriminação tonal, que tem como objetivo avaliar a capacidade de memorizar e identificar duas sequências de notas (melodia) que serão apresentadas a você. Ou seja, durante o teste, você ouvirá duas melodias com 1 segundo de silêncio entre elas. Essas duas melodias podem ser iguais ou diferentes. Se você achar que as sequências são iguais, você deve marcar a opção "SIM", se forem diferentes, você deve marcar a opção "NÃO" ao final de cada série. Serão apresentadas 10 pares de melodias para cada condição (número de notas), que variam entre 4, 6, 8 ou 10 notas.

source: In this test, you will hear a sequence of notes. After the notes are played, you will be asked if the last note in the sequence is the same as another specific note in the sequence.
pt_br: O teste N-back tonal avalia a capacidade de memorizar notas que foram apresentadas "n" posições atrás da última dentro de uma sequência de notas aleatórias. Você ouvirá sequências de notas aleatórias na escala de C maior e precisará identificar se a última nota é igual ou diferente da nota de referência (nota n). A nota de referência pode ser a penúltima (n = 1), antepenúltima (n = 2), 3ª antes da última (n = 3), e assim por diante até a 6ª nota antes da última. Se as notas forem iguais, você deve marcar a opção "SIM", se forem diferentes, você deve marcar a opção "NÃO". O teste é feito 10 vezes para cada "n" de referência.

source: The quantity of notes needs to be less than or equal to the TDT sequences.
pt_br: A quantidade de notas deve ser menor ou igual à das sequências TDT.

source: First, let's check if you can hear all the notes. Adjust the volume as needed until you can hear all the notes well.
pt_br: Primeiro, vamos verificar se você consegue ouvir todas as notas. Ajuste o volume conforme necessário até que você consiga ouvir todas as notas bem.

source: Volume test
pt_br: Teste de volume

source: Participant ID
pt_br: ID do participante

source: Starting n-back
pt_br: N-back inicial

source: The number of notes needs to be greater than or equal to the initial n-back + number of trials.
pt_br: A quantidade de notas deve ser maior ou igual ao n-back inicial + quantidade de séries.

source: Currently, the only number of notes available is {}.
pt_br: Atualmente, a(s) única(s) quantidade de notas disponível é(são) {}.

source: Since just {AVAILABLE_NUMBER_OF_TRIALS} sequences exist for the TDT test for now, number_of_trials must be less than or equal to {AVAILABLE_NUMBER_OF_TRIALS}. Got {text} instead.
pt_br: Como existem apenas {AVAILABLE_NUMBER_OF_TRIALS} sequências para o teste TDT por enquanto, o número de séries deve ser menor ou igual a {AVAILABLE_NUMBER_OF_TRIALS}. Foi recebido {text} em vez disso.

source: Please enter a fraction or a decimal bigger than 0, not "{}".
pt_br: Por favor, digite uma fração ou um decimal maior que 0, não "{}".

source: Please enter an integer bigger than 0, not "{}".
pt_br: Por favor, digite um número inteiro maior que 0, não "{}".

source: Please enter a valid instrument ({VALID_INSTRUMENTS_STR}), not "{text}".
pt_br: Por favor, digite um instrumento válido ({VALID_INSTRUMENTS_STR}), não "{text}".

source: Number of sequences
pt_br: Quantidade de sequências

source: Please enter a valid {} {}.
pt_br: Por favor, digite um(a) {} válido(a) {}.

source: Please enter a number.
pt_br: Por favor, digite um número.

source: Please enter a valid fraction.
pt_br: Por favor, digite uma fração válida.

source: Reset to default
pt_br: Resetar para o padrão
